// © Copyright 2004-2008, 2015-2016 HP Development Company, L.P.

HSDTaskName = "文件上载";
kUploadingTitleStringKey = "正在上载...";
kUploadingReceiveResponseTitleStringKey = "正在接收响应...";

// Errors
kFileOpenError = "无法打开文件 %@。";
kFileOpenErrorExplanation = "此文件已损坏，或者已被移至另一位置、重命名或者删除。请检查文件位置或者选择其他文件并重试。";
kPrintChannelOpenError = "无法打开打印机通道。";
kPrintChannelOpenErrorExplanation = "请检查打印机是否已连接并开启，然后重试。";
kSendDataError = "无法将数据发送到打印机。";
kSendDataErrorExplanation = "请检查打印机是否已连接并开启，然后重试。";

HSDDescriptionField = "选择文件并将其传送至打印机。此操作的结果取决于所传送文件的内容。";
HSDFilePathLabel = "文件名：";
HSDFilePathField = "<未选择>";
HSDChooseButton = "选择...";
HSDGetResponseButton = "显示设备响应";
HSDUploadButton = "上载";

HSDProgressTitle = "正在上载...";
HSDCancelButton = "取消";

HSDCloseButton = "关闭";
